# SF Salaries Exercise

Selamat datang di latihan untuk melatih keterampilan pandas Anda! Kami menggunakan Dataset SF Salaries dari [Kaggle!](https://www.kaggle.com/kaggle/sf-salaries) Cukup ikuti dan selesaikan tugas yang diuraikan di bawah ini. Tugas akan semakin sulit seiring berjalannya waktu.

**import library pandas as pd**

In [2]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [3]:
import pandas as pd

**baca file Salaries.csv sebagai dataframe bernama sal.**

In [4]:
sal =  pd.read_csv("/content/gdrive/MyDrive/dataset/Salaries.csv")

**cek head dari DataFrame**

In [5]:
sal.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

Gunakan .info() untuk mengetahui berapa banyak entri yang ada

In [6]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**Berapakah rata-rata dari BasePay?**

In [7]:
sal["BasePay"].mean()

66325.44884050643

**Berapakah nilai tertinggi dari OvertimePay?**

In [8]:
sal["OvertimePay"].max()

245131.88

**Apa pekerjaan dari JOSEPH DRISCOLL?**

*Catatan: Gunakan huruf besar semua, jika tidak, Anda mungkin mendapatkan jawaban yang tidak cocok (ada juga huruf kecil Joseph Driscoll)*

In [9]:
sal[sal.EmployeeName=="JOSEPH DRISCOLL"].JobTitle

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**Berapa penghasilan JOSEPH DRISCOLL (termasuk keuntungannya)?**

In [10]:
sal[sal.EmployeeName=="JOSEPH DRISCOLL"].TotalPay

24    270324.91
Name: TotalPay, dtype: float64

**Siapa nama orang yang dibayar paling tinggi (termasuk tunjangan)?**

In [11]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

**Siapa nama orang yang dibayar paling rendah (termasuk tunjangan)? Apakah Anda memperhatikan sesuatu yang aneh tentang berapa banyak dia dibayar?**

In [12]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

            Id EmployeeName  ...         Agency  Status
148653  148654    Joe Lopez  ...  San Francisco     NaN

[1 rows x 13 columns]

**Berapa rata-rata BasePay dari semua karyawan per tahun?**

In [13]:
dat = sal.groupby("Year").agg({"BasePay":"mean"})
dat

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

**Ada berapa banyak job titles?**

*Catatan : Unique job titles*

In [14]:
bos = sal["JobTitle"].value_counts()
bos.count()

2159

**Apa 5 pekerjaan paling umum teratas?**

In [52]:
# job= sal.groupby("JobTitle").agg({"Year":"count"})
# kerja = job.sort_values(by=["Year"], ascending=False)
# kerja.head(5)

kok = sal['JobTitle'].value_counts()
kok.iloc[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

**Berapa Pekerjaan yang diwakili oleh hanya satu orang pada tahun 2013?**

*CATATAN: Pekerjaan dengan hanya satu kemunculan di 2013*

In [57]:
ja = sal["Year"]==2013
bos = sal.loc[ja]["JobTitle"].value_counts()==1
bos.sum()

202

**Berapa banyak orang yang memiliki kata Chief dalam jabatannya?**

In [56]:
sal["JobTitle"].str.contains("CHIEF|Chief").sum()

627

**Bonus: Apakah ada korelasi antara panjang string Pekerjaan dan Gaji?**

In [59]:
sal['title_len'] = sal["JobTitle"].str.len()

cor = sal[["title_len","TotalPayBenefits"]]
cor.corr(method='pearson')

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000